{
  "plugins": {
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip"
    },
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp"
    },
    "blink.lib": {
      "src": "https://github.com/saghen/blink.lib"
    },
    "bufferline.nvim": {
      "src": "https://github.com/akinsho/bufferline.nvim"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "claudecode.nvim": {
      "src": "https://github.com/coder/claudecode.nvim"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "dracula.nvim": {
      "src": "https://github.com/Mofiqul/dracula.nvim"
    },
    "everforest": {
      "src": "https://github.com/sainnhe/everforest"
    },
    "fff.nvim": {
      "src": "https://github.com/dmtrKovalenko/fff.nvim"
    },
    "flash.nvim": {
      "src": "https://github.com/folke/flash.nvim"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "grug-far.nvim": {
      "src": "https://github.com/MagicDuck/grug-far.nvim"
    },
    "gruvbox.nvim": {
      "src": "https://github.com/ellisonleao/gruvbox.nvim"
    },
    "harpoon": {
      "src": "https://github.com/ThePrimeagen/harpoon",
      "version": "'harpoon2'"
    },
    "indent-blankline.nvim": {
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim"
    },
    "kanagawa.nvim": {
      "src": "https://github.com/rebelot/kanagawa.nvim"
    },
    "lazydev.nvim": {
      "src": "https://github.com/folke/lazydev.nvim"
    },
    "lazygit.nvim": {
      "src": "https://github.com/kdheepak/lazygit.nvim"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/mason-org/mason-lspconfig.nvim"
    },
    "mason-tool-installer.nvim": {
      "src": "https://github.com/WhoIsSethDaniel/mason-tool-installer.nvim"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim"
    },
    "mini.ai": {
      "src": "https://github.com/echasnovski/mini.ai"
    },
    "mini.nvim": {
      "src": "https://github.com/echasnovski/mini.nvim"
    },
    "monokai-pro": {
      "src": "https://github.com/gthelding/monokai-pro.nvim"
    },
    "neo-tree.nvim": {
      "src": "https://github.com/nvim-neo-tree/neo-tree.nvim"
    },
    "neotest": {
      "src": "https://github.com/nvim-neotest/neotest"
    },
    "neotest-dotnet": {
      "src": "https://github.com/Issafalcon/neotest-dotnet"
    },
    "noice.nvim": {
      "src": "https://github.com/folke/noice.nvim"
    },
    "nord.nvim": {
      "src": "https://github.com/shaunsingh/nord.nvim"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "nvim-colorizer.lua": {
      "src": "https://github.com/norcalli/nvim-colorizer.lua"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-dap-cs": {
      "src": "https://github.com/nicholasmata/nvim-dap-cs"
    },
    "nvim-dap-ui": {
      "src": "https://github.com/rcarriga/nvim-dap-ui"
    },
    "nvim-dap-virtual-text": {
      "src": "https://github.com/theHamsta/nvim-dap-virtual-text"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio"
    },
    "nvim-notify": {
      "src": "https://github.com/rcarriga/nvim-notify"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects",
      "version": "'main'"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "nvim-window-picker": {
      "src": "https://github.com/s1n7ax/nvim-window-picker"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "opencode.nvim": {
      "src": "https://github.com/nickjvandyke/opencode.nvim"
    },
    "persistence.nvim": {
      "src": "https://github.com/folke/persistence.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "render-markdown.nvim": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim"
    },
    "rose-pine": {
      "src": "https://github.com/rose-pine/neovim"
    },
    "roslyn.nvim": {
      "src": "https://github.com/seblyng/roslyn.nvim"
    },
    "supermaven-nvim": {
      "src": "https://github.com/supermaven-inc/supermaven-nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "tiny-inline-diagnostic.nvim": {
      "src": "https://github.com/rachartier/tiny-inline-diagnostic.nvim"
    },
    "toggleterm.nvim": {
      "src": "https://github.com/akinsho/toggleterm.nvim"
    },
    "tokyonight.nvim": {
      "src": "https://github.com/folke/tokyonight.nvim"
    },
    "trouble.nvim": {
      "src": "https://github.com/folke/trouble.nvim"
    },
    "vim-tmux-navigator": {
      "src": "https://github.com/christoomey/vim-tmux-navigator"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim"
    }
  }
}
